КАКерамика_моя_старая_база/src/Enums/КонтурЛогистика_ЕдиницыИзмеренияГСМ/КонтурЛогистика_ЕдиницыИзмеренияГСМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КонтурЛогистика_ЕдиницыИзмеренияГСМ</name>
  <enumValues>
    <name>л</name>
  </enumValues>
  <enumValues>
    <name>лСНГ</name>
  </enumValues>
  <enumValues>
    <name>КубМСПГ</name>
  </enumValues>
  <enumValues>
    <name>кВтЧ</name>
  </enumValues>
  <enumValues>
    <name>Иное</name>
  </enumValues>
</mdclass:Enum>

КАКерамика_моя_старая_база/src/Enums/КонтурЛогистика_ЕдиницыИзмеренияГСМ/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Функция ЗначениеДляXDTO(Значение) Экспорт
	
	Если Значение = Перечисления.КонтурЛогистика_ЕдиницыИзмеренияГСМ.л Тогда
		
		Результат = "1";
		
	ИначеЕсли Значение = Перечисления.КонтурЛогистика_ЕдиницыИзмеренияГСМ.лСНГ Тогда
		
		Результат = "2";
		
	ИначеЕсли Значение = Перечисления.КонтурЛогистика_ЕдиницыИзмеренияГСМ.КубМСПГ Тогда
		
		Результат = "3";
		
	ИначеЕсли Значение = Перечисления.КонтурЛогистика_ЕдиницыИзмеренияГСМ.кВтЧ Тогда
		
		Результат = "4";
		
	Иначе
		
		Результат = "5";
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ЗначениеИзXDTO(Значение) Экспорт
	
	Если Значение = "1" Тогда 
		
		Результат = л;
		
	ИначеЕсли Значение = "2" Тогда 
		
		Результат = лСНГ;
		
	ИначеЕсли Значение = "3" Тогда 
		
		Результат = КубМСПГ;
		
	ИначеЕсли Значение = "4" Тогда 
		
		Результат = кВтЧ;
		
	ИначеЕсли Значение = "5" Тогда 
		
		Результат = Иное;
		
	Иначе		
		
		Результат = ПустаяСсылка();
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецЕсли
